import React, { Component } from 'react';
import SimScreen from './SimScreen';
import { Link, Redirect } from 'react-router-dom'

class ManagerStartSimulation extends Component {
  
  render() {
        return (
          // need to redirect but not implemented yet
            <div className="App">
              <SimScreen
              dir={"rtl"}
              title={"שם הסימולציה"}
              subTitleTitle={"התחברות"}
              //short text and long text for testing out
              subTitleText={" תיאור הסימולציה הוא הטקסט המדהים הזה שיש כאן בכותרת המשנה"}
              // subTitleText={" תיאור הסימולציה הוא הטקסט המיותר שיש כאן בכותרת המשנהתיאור הסימולציה הוא הטקסט המיותר שיש כאן בכותרת המשנהתיאור הסימולציה הוא הטקסט המיותר שיש כאן בכותרת המשנהתיאור הסימולציה הוא הטקסט המיותר שיש כאן בכותרת המשנהתיאור הסימולציה הוא הטקסט המיותר שיש כאן בכותרת המשנה"}

              numOfButtons={1} 
              isMenahel={true} 
              //short text and long text for testing out
            simActionText={"הסימולציה צריכה להעביר המחשה לתלמידים על הפסוק בראשית ברא אלוקים את השמיים ואת הארץ"}
              // simActionText={"לורם איפסום דולור סיט אמט, קונסקטורר אדיפיסינג אלית סחטיר בלובק. תצטנפל בלינדו למרקל אס לכימפו, דול, צוט ומעיוט - לפתיעם ברשג - ולתיעם גדדיש. קוויז דומור ליאמום בלינך רוגצה. לפמעט מוסן מנת. לורם איפסום דולור סיט אמט, קונסקטורר אדיפיסינג אלית. סת אלמנקום ניסי נון ניבאה. דס איאקוליס וולופטה דיאם. וסטיבולום אט דולור, קראס אגת לקטוס וואל אאוגו וסטיבולום סוליסי טידום בעליק. לורם איפסום דולור סיט אמט, קולורס מונפרד אדנדום סילקוף, מרגשי ומרגשח. עמחליף נולום ארווס סאפיאן - פוסיליס קוויס, אקווזמן קוואזי במר מודוף. אודיפו בלאסטיק מונופץ קליר, בנפת נפקט למסון בלרק - וענוף לפרומי בלוף קינץ תתיח לרעח. לת צשחמי מוסן מנת. להאמית קרהשק סכעיט דז מא, מנכם למטכין נשואי מנורך. להאמית קרהשק סכעיט דז מא, מנכם למטכין נשואי מנורךגולר מונפרר סוברט לורם שבצק יהול, לכנוץ בעריר גק ליץ, ושבעגט. הועניב היושבב שערש שמחויט - שלושע ותלברו חשלו שעותלשך וחאית נובש ערששף. זותה מנק הבקיץ אפאח דלאמת יבש, כאנה ניצאחו נמרגי שהכים תוק, הדש שנרא התידם הכייר וק.קוואזי במר מודוף. אודיפו בלאסטיק מונופץ קליר, בנפת נפקט למסון בלרק - וענוף. "}
              Button1Text={"התחלה"}
              OnClickButton1={"startSim"}
              Button2Text={"סיום"}
              OnClickButton2={"endSim"}
              />
            </div>
          );
    }
}

export default ManagerStartSimulation;